Documents/Тренировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Тренировка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тренер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчастникиОбъединения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПодходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчастникиОбъединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Роли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Тренировка/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Мероприятие",, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   Тренировка.Тренер
        |ИЗ
        |   Документ.Тренировка КАК Тренировка
        |ГДЕ
    	|   ((Тренировка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) ИЛИ
		|	(ДОБАВИТЬКДАТЕ(Тренировка.Дата, Минута, Тренировка.Длительность) МЕЖДУ &ДатаНачала И &ДатаОкончания)) 
		|	И Тренировка.Номер <> &Номер
		|   И Тренировка.Тренер = &Тренер";

    Запрос.УстановитьПараметр("Тренер", ТекущийОбъект.Тренер);
    Запрос.УстановитьПараметр("ДатаНачала", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущийОбъект.Дата + 60 * ТекущийОбъект.Длительность);
	Запрос.УстановитьПараметр("Номер", ТекущийОбъект.Номер);
	
	Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
       Сообщить("Документ с такими реквизитами существует. Документ не может быть создан.");
       Отказ = Истина;
   КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
